In [4]:
import pandas as pd
import numpy as np
dictionary = {'Name':['Kanon', 'Rahim', 'Milon', 'Yesmin', 'Jami'],
              'Id':[13,14,np.nan,56,89],
              'Test Score':[70, np.nan, 84, 62, 73]
             }

In [6]:
dictionary

{'Name': ['Kanon', 'Rahim', 'Milon', 'Yesmin', 'Jami'],
 'Id': [13, 14, nan, 56, 89],
 'Test Score': [70, nan, 84, 62, 73]}

In [40]:
df =pd.DataFrame(dictionary)

 Convert dictionary to dataframe

In [41]:
df[:]

     Name    Id  Test Score
0   Kanon  13.0        70.0
1   Rahim  14.0         NaN
2   Milon   NaN        84.0
3  Yesmin  56.0        62.0
4    Jami  89.0        73.0

Checking for missing values

In [42]:
df.isnull().sum()

Name          0
Id            1
Test Score    1
dtype: int64

In [32]:
df.isnull()

    Name     Id  Test Score
0  False  False       False
1  False  False        True
2  False  False       False
3  False  False       False
4  False  False       False

The first thing you can do, is fill in the missing values with a word or symbol.

In [29]:
# df.fillna('*')

If we want to fill in the values for a certain column

In [30]:
# df.Id.fillna('-')

The second thing you do is replace it with the average

In [43]:
df.isnull().sum()

Name          0
Id            1
Test Score    1
dtype: int64

In [46]:
df.Id = df.Id.fillna(df.Id.mean())

In [47]:
df

     Name    Id  Test Score
0   Kanon  13.0        70.0
1   Rahim  14.0         NaN
2   Milon  43.0        84.0
3  Yesmin  56.0        62.0
4    Jami  89.0        73.0

In [50]:
df['Id'] = df.Id.fillna(df['Id'].interpolate())

In [51]:
df

     Name    Id  Test Score
0   Kanon  13.0        70.0
1   Rahim  14.0         NaN
2   Milon  43.0        84.0
3  Yesmin  56.0        62.0
4    Jami  89.0        73.0

In [55]:
df['Test Score'].sort_values(ascending = False).head()

2    84.0
4    73.0
0    70.0
3    62.0
1     NaN
Name: Test Score, dtype: float64

In [56]:
df['Test Score'] = df['Test Score'].fillna(df['Test Score'].median())

In [57]:
df

     Name    Id  Test Score
0   Kanon  13.0        70.0
1   Rahim  14.0        71.5
2   Milon  43.0        84.0
3  Yesmin  56.0        62.0
4    Jami  89.0        73.0